{
    "widget.heading": "ADMIN ALERT CONFIGURATION",
    "config.error.body": "Cannot fetch provider configuration for APIM Admin Alert Configuration widget",
    "config.error.heading": "Configuration Error !",
    "nodata.error.body": "No data available for the selected options",
    "nodata.error.heading": "No Data Available !",
    "alerts.subscribe.to.alerts.heading": "Manage Alert Subscriptions",
    "alerts.subscribe.to.alerts.subheading": "Select the Alert types to subscribe/ unsubscribe and click Save.",
    "alerts.unsubscribe.confirm.dialog.heading": "Confirm unsubscription from All Alerts",
    "alerts.unsubscribe.confirm.dialog.message": "This will remove all the existing alert subscriptions and emails. This action cannot be undone.",
    "alerts.unsubscribe.all.btn": "Unsubscribe All",
    "alerts.cancel.btn": "Cancel",
    "alerts.save.btn": "Save",
    "alerts.add.email.helper.txt": "Email address to receive alerts of selected  Alert types. Type email address and press Enter to add.",
    "alerts.add.email.txt": "Enter email address and press Enter",
    "alerts.email.field.label": "Emails",
    "alerts.abnormal.response.time": "Abnormal Response Time",
    "alerts.abnormal.request.time.description": "This alert gets triggered if the response time of a particular API is higher than the predefined value. These alerts could be treated as an indication of a slow WSO2 API Manager runtime or a slow backend.",
    "alerts.abnormal.backend.time": "Abnormal Backend Time",
    "alerts.abnormal.backend.time.description": "This alert gets triggered if the backend time corresponding to a particular API is higher than the predefined value. These alerts could be treated as an indication of a slow backend. In technical terms, if the backend time of a particular API of a tenant lies outside the predefined value, an alert will be sent out.",
    "alerts.abnormal.request.count": "Abnormal Request Count",
    "alerts.abnormal.request.count.description": "This alert is triggered if there is a sudden spike the request count within a period of one minute by default for a particular API for an application. These alerts could be treated as an indication of a possible high traffic, suspicious activity, possible malfunction of the client application, etc.",
    "alerts.abnormal.resource.access": "Abnormal Resource Access",
    "alerts.abnormal.resource.access.description": "This alert is triggered if there is a change in the resource access pattern of a user of a particular application. These alerts could be treated as an indication of a suspicious activity made by a user over your application.",
    "alerts.unseen.source.ip.access": "Unseen Source IP Access",
    "alerts.unseen.source.ip.access.description": "This alert is triggered if there is either a change in the request source IP for a particular application by a user or if the request is from an IP used before a time period of 30 days (default). These alerts could be treated as an indication of a suspicious activity made by a user over an application.",
    "alerts.tier.crossing" : "Tier Crossing",
    "alerts.tier.crossing.description" : "This alert is triggered if at least one of the two cases below are satisfied; if a particular application gets throttled out for hitting the subscribed tier limit of that application more than 10 times (by default) within an hour (by default) or if a particular user of an application gets throttled out for hitting the subscribed tier limit of a particular API more than 10 times (by default) within a day (by default)",
    "alerts.api.health.monitor": "Health Availability",
    "alerts.api.health.monitor.description": "This alert gets triggered if at least one of the two cases below are satisfied; Response time of an API > Threshold response time value defined for that particular API or Response status code >= 500 (By Default) AND Response status code < 600 (By Default)"
}
